init.org
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{inconsolata}
#+TITLE: Emacs configuration file
#+AUTHOR: Lars Tveito

* About
  This is a Emacs configuration file written in =org-mode=. There are a few
  reasons why I wanted to do this. My =.emacs.d/= was a mess, and needed a
  proper clean-up. Also I like keeping all my configurations in a single
  file, using =org-mode= I can keep this file /organized/. I aim to briefly
  explain all my configurations.

* Configurations
** Meta

   Emacs can only load =.el=-files. We can use =C-c C-v t= to run
   =org-babel-tangle=, which extracts the code blocks from the current file
   into a source-specific file (in this case a =.el=-file).

   To avoid doing this each time a change is made we can add a function to
   the =after-save-hook= ensuring to always tangle and byte-compile the
   =org=-document after changes.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun init-hook ()
       "If the current buffer is 'init.org' the code-blocks are
     tangled, and the tangled file is compiled."
       (when (equal (buffer-file-name)
                    (expand-file-name (concat user-emacs-directory "init.org")))
         (org-babel-tangle)
         (byte-compile-file (concat user-emacs-directory "init.el"))))

     (add-hook 'after-save-hook 'init-hook)
   #+END_SRC

** Package

   Managing extensions for Emacs is simplified using =package= which
   is built in to Emacs 24 and newer. To load downloaded packages we
   need to initialize =package=.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'package)
     (package-initialize)
   #+END_SRC

   Packages can be fetched from different mirrors, [[http://melpa.milkbox.net/#/][melpa]] is the largest
   archive and is well maintained.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (add-to-list 'package-archives
                  '("MELPA" . "http://melpa.milkbox.net/packages/") t)
   #+END_SRC

   We can define a predicate that tells us wither or not the newest version
   of a package is installed.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun newest-package-installed-p (package)
       "Return true if the newest available PACKAGE is installed."
       (when (package-installed-p package)
         (let* ((local-pkg-desc (or (assq package package-alist)
                                    (assq package package--builtins)))
                (newest-pkg-desc (assq package package-archive-contents)))
           (version-list-= (package-desc-vers (cdr local-pkg-desc))
                           (package-desc-vers (cdr newest-pkg-desc))))))
   #+END_SRC

   Let's write a function to install a package if it is not installed or
   upgrades it if a new version has been released. Here our predicate comes
   in handy.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun upgrade-or-install-package (package)
       "Unless the newest available version of PACKAGE is installed
     PACKAGE is installed and the current version is deleted."
       (unless (newest-package-installed-p package)
         (let ((pkg-desc (assq package package-alist)))
           (when pkg-desc
             (package-delete (symbol-name package)
                             (package-version-join
                              (package-desc-vers (cdr pkg-desc)))))
           (package-install package))))
   #+END_SRC

   The =package-refresh-contents= function downloads archive descriptions,
   this is a major bottleneck in this configuration. To avoid this we can
   try to only check for updates once every day or so. Here are three
   variables. The first specifies how often we should check for updates. The
   second specifies wither one should update during the initialization. The
   third is a path to a file where a time-stamp is stored in order to check
   when packages were updated last.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defvar days-between-updates 1)
     (defvar do-package-update-on-init t)
     (defvar package-last-update-file
       (expand-file-name (concat user-emacs-directory ".package-last-update")))
   #+END_SRC

   The tricky part is figuring out when the last time the Emacs was updated!
   Here is a hacky way of doing it, using [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Time-Stamps.html][time-stamps]]. By adding a
   time-stamp to the a file, we can determine wither or not to do an
   update. After that we must run the =time-stamp=-function to update the
   time-stamp.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'time-stamp)
     ;; Open the package-last-update-file
     (with-temp-file package-last-update-file
       (if (file-exists-p package-last-update-file)
           (progn
             ;; Insert it's original content's.
             (insert-file-contents package-last-update-file)
             (let ((start (re-search-forward time-stamp-start nil t))
                   (end (re-search-forward time-stamp-end nil t)))
               (when (and start end)
                 ;; Assuming we have found a time-stamp, we check determine if it's
                 ;; time to update.
                 (setq do-package-update-on-init
                       (<= days-between-updates
                           (days-between
                            (current-time-string)
                            (buffer-substring-no-properties start end))))
                 ;; Remember to update the time-stamp.
                 (when do-package-update-on-init
                   (time-stamp)))))
         ;; If no such file exists it is created with a time-stamp.
         (insert "Time-stamp: <>")
         (time-stamp)))
   #+END_SRC

   Now we can use the function above to make sure packages are installed and
   up to date. Here are some packages I find useful (some of these
   configurations are also dependent on them).

   #+BEGIN_SRC emacs-lisp :tangle yes
     (when do-package-update-on-init
       (package-refresh-contents))

     (dolist (package
              '(ac-geiser         ; Auto-complete backend for geiser
                ac-slime          ; An auto-complete source using slime completions
                ace-jump-mode     ; quick cursor location minor mode
                auto-compile      ; automatically compile Emacs Lisp libraries
                auto-complete     ; auto completion
                elscreen          ; window session manager
                expand-region     ; Increase selected region by semantic units
                flx-ido           ; flx integration for ido
                ido-vertical-mode ; Makes ido-mode display vertically.
                geiser            ; GNU Emacs and Scheme talk to each other
                haskell-mode      ; A Haskell editing mode
                jedi              ; Python auto-completion for Emacs
                magit             ; control Git from Emacs
                markdown-mode     ; Emacs Major mode for Markdown-formatted files.
                monokai-theme     ; A fruity color theme for Emacs.
                move-text         ; Move current line or region with M-up or M-down
                multiple-cursors  ; Multiple cursors for Emacs.
                org               ; Outline-based notes management and organizer
                paredit           ; minor mode for editing parentheses
                pretty-lambdada   ; the word `lambda' as the Greek letter.
                smex              ; M-x interface with Ido-style fuzzy matching.
                ))
       (when do-package-update-on-init
         (upgrade-or-install-package package)))
   #+END_SRC

** Require

   Some features are not loaded by default to minimize initialization time,
   so they have to be required (or loaded, if you will).

   #+BEGIN_SRC emacs-lisp :tangle yes
     (dolist (feature
              '(auto-compile             ; auto-compile .el files
                auto-complete-config     ; a configuration for auto-complete-mode
                jedi                     ; auto-completion for python
                pretty-lambdada          ; show 'lambda' as the greek letter.
                ox-latex                 ; the latex-exporter (from org)
                recentf                  ; recently opened files
                tex-mode                 ; TeX, LaTeX, and SliTeX mode commands
                ))
       (require feature))
   #+END_SRC

