init.el

(defun init-hook ()
  "If the current buffer is 'init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name (concat user-emacs-directory "init.org")))
    (org-babel-tangle)
    (byte-compile-file (concat user-emacs-directory "init.el"))))

(add-hook 'after-save-hook 'init-hook)

(require 'package)
(package-initialize)

(add-to-list 'package-archives
             '("MELPA" . "http://melpa.milkbox.net/packages/") t)

(defun newest-package-installed-p (package)
  "Return true if the newest available PACKAGE is installed."
  (when (package-installed-p package)
    (let* ((local-pkg-desc (or (assq package package-alist)
                               (assq package package--builtins)))
           (newest-pkg-desc (assq package package-archive-contents)))
      (version-list-= (package-desc-vers (cdr local-pkg-desc))
                      (package-desc-vers (cdr newest-pkg-desc))))))

(defun upgrade-or-install-package (package)
  "Unless the newest available version of PACKAGE is installed
PACKAGE is installed and the current version is deleted."
  (unless (newest-package-installed-p package)
    (let ((pkg-desc (assq package package-alist)))
      (when pkg-desc
        (package-delete (symbol-name package)
                        (package-version-join
                         (package-desc-vers (cdr pkg-desc)))))
      (package-install package))))

(defvar days-between-updates 1)
(defvar do-package-update-on-init t)

(require 'time-stamp)
;; Open the 'user-init-file' and write any changes.
(with-temp-file user-init-file
  ;; Insert it's original content's.
  (insert-file-contents user-init-file)
  (forward-line time-stamp-line-limit)
  (let ((bound (point)))
    (goto-char (point-min))
    ;; We search for the time-stamp.
    (let ((start (re-search-forward time-stamp-start bound t))
          (end (re-search-forward time-stamp-end bound t)))
      (when (and start end)
        ;; Assuming we have found a time-stamp, we check determine if it's
        ;; time to update.
        (setq do-package-update-on-init
              (<= days-between-updates
                  (days-between
                   (current-time-string)
                   (buffer-substring-no-properties start end)))))))
  ;; Remember to update the time-stamp.
  (time-stamp))

(when do-package-update-on-init
  (package-refresh-contents))

(dolist (package
         '(ac-geiser         ; Auto-complete backend for geiser
           ac-slime          ; An auto-complete source using slime completions
           ace-jump-mode     ; quick cursor location minor mode
           auto-compile      ; automatically compile Emacs Lisp libraries
           auto-complete     ; auto completion
           elscreen          ; window session manager
           expand-region     ; Increase selected region by semantic units
           flx-ido           ; flx integration for ido
           ido-vertical-mode ; Makes ido-mode display vertically.
           geiser            ; GNU Emacs and Scheme talk to each other
           haskell-mode      ; A Haskell editing mode
           jedi              ; Python auto-completion for Emacs
           magit             ; control Git from Emacs
           markdown-mode     ; Emacs Major mode for Markdown-formatted files.
           monokai-theme     ; A fruity color theme for Emacs.
           move-text         ; Move current line or region with M-up or M-down
           multiple-cursors  ; Multiple cursors for Emacs.
           org               ; Outline-based notes management and organizer
           paredit           ; minor mode for editing parentheses
           pretty-lambdada   ; the word `lambda' as the Greek letter.
           smex              ; M-x interface with Ido-style fuzzy matching.
           ))
  (when do-package-update-on-init
    (upgrade-or-install-package package)))

(dolist (feature
         '(auto-compile             ; auto-compile .el files
           auto-complete-config     ; a configuration for auto-complete-mode
           jedi                     ; auto-completion for python
           pretty-lambdada          ; show 'lambda' as the greek letter.
           ox-latex                 ; the latex-exporter (from org)
           recentf                  ; recently opened files
           tex-mode                 ; TeX, LaTeX, and SliTeX mode commands
           ))
  (require feature))
